# Задание 7
n = float(input("Введите n: "))
k = 1

while 1 + 1/k <= n:
    k += 1

print(f"Первое число больше {n}: 1 + 1/{k} = {1 + 1/k}")